#!/bin/bash
   # هذا السكربت يحسب الفائدة البسيطة بناءً على المبلغ الرئيسي،
   # معدل الفائدة السنوي ومدة الوقت بالسنوات.
   # لا تستخدم هذا في الإنتاج. لأغراض العينة فقط.
   # المؤلف: أبكار ليدر (IBM)
   # مؤلفون إضافيون:
   # <اسم مستخدم GitHub الخاص بك>
   # المدخلات:
   # p، المبلغ الرئيسي
   # t، مدة الوقت بالسنوات
   # r، معدل الفائدة السنوي
   # المخرجات:
   # الفائدة البسيطة = p*t*r
   echo "أدخل المبلغ الرئيسي:"
   read p
   echo "أدخل معدل الفائدة سنويًا:"
   read r
   echo "أدخل مدة الوقت بالسنوات:"
   read t
   s=`expr $p \* $t \* $r / 100`
   echo "الفائدة البسيطة هي: "
   echo $s
